cases/T5_ahmed/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  coupledFoam test case T5 - Ahmed body 25 deg, half model (spec 13).
  U_inf = 40 m/s; freestream I = 0.5 %: k = 1.5 (0.005 * 40)^2 = 0.06,
  nut/nu = 100: omega = k / nut = 40. Ground moves with U_inf.
  Body patches through their group bodyGroup; ymin (type symmetry) comes
  from setConstraintTypes and has no explicit entry.
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (40 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    // Moving ground (spec 13): fixedValue U = U_inf
    ground
    {
        type            fixedValue;
        value           uniform (40 0 0);
    }

    bodyGroup
    {
        type            noSlip;
    }

    top
    {
        type            slip;
    }

    side
    {
        type            slip;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
