cases/T5_ahmed/Allrun
#!/bin/sh
#------------------------------------------------------------------------------
# T5 - Ahmed body 25 deg, half model, kOmegaSST, snappyHexMesh (spec 13)
#
#   ./Allrun [-mesh fine|coarse] [-solver coupledFoam|simpleFoam] [-np N]
#            [-turbulence MODEL] [-mesh-only] [-remesh] [-restart]
#
#   -mesh fine   refinement boxes at levels 1 2 3 4 5, target 5-8 M cells
#                                                                    [default]
#   -mesh coarse boxes at levels 1 2 2 3 4, ~1-2 M cells (development mesh);
#                body surface, features and layers as fine. Realised by
#                foamDictionary edits of system/snappyHexMeshDict
#   -np N        ranks for meshing and solving (default 16, scotch)
#   -mesh-only   mesh and checkMesh only (or reuse and re-decompose an
#                existing mesh for -np); writes mesh_cells.txt and mesh.info
#   -remesh      mesh again even if the case already holds a mesh of the
#                requested variant
#   -restart     continue the solver from the latest time; no mesh, no
#                potentialFoam, log goes to log.<solver>.restart
#
# Mesh reuse: a case that already holds a mesh of the requested variant
# (mesh.info, e.g. copied from a -mesh-only run) is not meshed again. A mesh
# decomposed for a different rank count is reconstructed once
# (reconstructParMesh -constant) and decomposed for -np.
#
# The geometry geometry/ahmed25.stl is generated by geometry/make_ahmed.py
# (numpy-stl; interpreter ${CF_PYTHON:-python3}) if it does not exist yet,
# and copied to constant/triSurface. Everything stays decomposed; there is no
# reconstructPar.
#
# coupledFoam with coupled.potentialInit yes: potentialFoam -writePhi
# -writep initialises U, p, phi first (spec 7.4). Parallel runs: mpirun with
# core binding (CF_MPI_BIND=none on a shared machine); CF_RANK_WRAPPER wraps
# every rank of the solver and potentialFoam (benchmark harness).
#------------------------------------------------------------------------------
cd "${0%/*}" || exit 1
. "${WM_PROJECT_DIR:?}"/bin/tools/RunFunctions

solver=coupledFoam
np=16
model=""
variant=fine
meshOnly=false
remesh=false
restart=false

while [ "$#" -gt 0 ]
do
    case "$1" in
        -mesh) variant="$2"; shift 2 ;;
        -solver) solver="$2"; shift 2 ;;
        -np) np="$2"; shift 2 ;;
        -turbulence) model="$2"; shift 2 ;;
        -mesh-only) meshOnly=true; shift ;;
        -remesh) remesh=true; shift ;;
        -restart) restart=true; shift ;;
        *) echo "Unknown option $1" 1>&2; exit 1 ;;
    esac
done

case "$variant" in
    fine|coarse) ;;
    *) echo "Unknown mesh variant '$variant' (fine|coarse)" 1>&2; exit 1 ;;
esac

bind="${CF_MPI_BIND:-core}"
if [ "$bind" = core ]
then
    mpiOpts="--bind-to core --map-by core"
else
    mpiOpts="--bind-to $bind"
fi

# Run an application serial or parallel; log name as $2.
# CF_RANK_WRAPPER (benchmark harness) wraps every rank, e.g. for
# /usr/bin/time -v (bench/rank_wrapper.sh).
runApp()
{
    app="$1"; log="$2"; shift 2
    if [ "$np" -gt 1 ]
    then
        mpirun $mpiOpts -np "$np" $CF_RANK_WRAPPER "$app" -parallel "$@" \
            > "$log" 2>&1
    else
        $CF_RANK_WRAPPER "$app" "$@" > "$log" 2>&1
    fi
}

# Meshing application, serial or parallel, never wrapped; fails on a
# non-zero exit code or a FOAM FATAL message in the log.
runMeshApp()
{
    app="$1"; log="$2"; shift 2
    echo "Running $app ($np ranks) -> $log"
    if [ "$np" -gt 1 ]
    then
        mpirun $mpiOpts -np "$np" "$app" -parallel "$@" > "$log" 2>&1
    else
        "$app" "$@" > "$log" 2>&1
    fi
    rc=$?
    if [ "$rc" -ne 0 ] || grep -q "FOAM FATAL" "$log"
    then
        echo "$app failed (exit $rc), see $log" 1>&2
        return 1
    fi
}

# Serial application with a fresh log (runApplication skips existing logs)
runSerial()
{
    app="$1"; log="$2"; shift 2
    echo "Running $app -> $log"
    "$app" "$@" > "$log" 2>&1
    rc=$?
    if [ "$rc" -ne 0 ] || grep -q "FOAM FATAL" "$log"
    then
        echo "$app failed (exit $rc), see $log" 1>&2
        return 1
    fi
}

meshInfo()
{
    [ -f mesh.info ] && sed -n "s/^$1  *//p" mesh.info
}

# writeMeshInfo <np> <reconstructed yes|no> <cells>
writeMeshInfo()
{
    printf 'variant %s\nnp %s\nreconstructed %s\ncells %s\n' \
        "$variant" "$1" "$2" "$3" > mesh.info
}

setSubdomains()
{
    foamDictionary -entry numberOfSubdomains -set "$np" \
        system/decomposeParDict > /dev/null
}

# Box refinement levels of the variant (idempotent: every variant sets all
# five boxes, so a case can be switched between fine and coarse)
setMeshLevels()
{
    case "$variant" in
        fine)   levels="1 2 3 4 5" ;;
        coarse) levels="1 2 2 3 4" ;;
    esac
    shm=system/snappyHexMeshDict
    i=1
    for lev in $levels
    do
        foamDictionary -disableFunctionEntries $shm \
            -entry castellatedMeshControls/refinementRegions/box$i/levels \
            -set "((1e15 $lev))" > /dev/null || return 1
        i=$((i + 1))
    done
    echo "Mesh variant $variant: box levels $levels"
}

# Geometry: generate the STL once (deterministic), copy it into the case
geometry()
{
    if [ ! -f geometry/ahmed25.stl ]
    then
        "${CF_PYTHON:-python3}" geometry/make_ahmed.py > log.make_ahmed 2>&1 \
            || { echo "make_ahmed.py failed, see log.make_ahmed" 1>&2
                 return 1; }
    fi
    mkdir -p constant/triSurface
    cp -f geometry/ahmed25.stl constant/triSurface/
}

# Case-specific mesh generation (parallel, like the motorBike tutorial)
mesh()
{
    # Clean completely first: hexRef8 cannot refine an already refined mesh
    rm -rf processor* constant/polyMesh constant/extendedFeatureEdgeMesh \
        constant/triSurface mesh.info mesh_cells.txt 0
    geometry || return 1

    setMeshLevels || return 1
    runSerial blockMesh log.blockMesh || return 1
    runSerial surfaceFeatureExtract log.surfaceFeatureExtract || return 1
    if [ "$np" -gt 1 ]
    then
        setSubdomains
        runSerial decomposePar log.decomposePar -force || return 1
    fi
    runMeshApp snappyHexMesh log.snappyHexMesh -overwrite || return 1
    runMeshApp checkMesh log.checkMesh -constant || return 1

    cells=$(sed -n 's/^ *cells: *\([0-9][0-9]*\).*/\1/p' log.checkMesh \
        | head -n 1)
    echo "$cells" > mesh_cells.txt
    if [ "$np" -gt 1 ]
    then
        writeMeshInfo "$np" no "$cells"
    else
        writeMeshInfo 1 yes "$cells"
    fi
    echo "Mesh $variant: $cells cells"
}

# Decompose an existing mesh for a different rank count
redecompose()
{
    have=$(meshInfo np)
    [ "$have" = "$np" ] && return 0
    echo "Mesh decomposed for $have ranks, re-decomposing for $np"
    if [ "$(meshInfo reconstructed)" != yes ]
    then
        runSerial reconstructParMesh log.reconstructParMesh -constant \
            || return 1
    fi
    rm -rf processor* 0
    if [ "$np" -gt 1 ]
    then
        setSubdomains
        runSerial decomposePar "log.decomposePar.np$np" -force || return 1
    fi
    writeMeshInfo "$np" yes "$(meshInfo cells)"
}

# Initial fields; earlier solutions of this case are removed
fields()
{
    rm -rf postProcessing
    for d in [1-9]* 0.[0-9]* processor*/[1-9]* processor*/0.[0-9]*
    do
        [ -d "$d" ] && rm -rf "$d"
    done
    if [ "$np" -gt 1 ]
    then
        rm -rf 0
        restore0Dir -processor
    else
        restore0Dir
    fi
}

foamDictionary -entry application -set "$solver" system/controlDict > /dev/null
cp "system/relaxation.$solver" system/relaxation
if [ -n "$model" ]
then
    foamDictionary -entry RAS.RASModel -set "$model" \
        constant/turbulenceProperties > /dev/null
fi

if [ "$restart" = true ]
then
    runApp "$solver" "log.$solver.restart"
    exit $?
fi

if [ "$remesh" = false ] && [ "$(meshInfo variant)" = "$variant" ]
then
    echo "Reusing mesh $variant ($(meshInfo cells) cells," \
        "decomposed for $(meshInfo np) ranks)"
else
    mesh || exit 1
fi

redecompose || exit 1

[ "$meshOnly" = true ] && exit 0

fields

if [ "$solver" = coupledFoam ]
then
    potential=$(foamDictionary -entry coupled.potentialInit -value \
        system/fvSolution 2>/dev/null)
    case "$potential" in
        yes|on|true)
            runApp potentialFoam log.potentialFoam -writePhi -writep || exit 1
            ;;
    esac
fi

runApp "$solver" "log.$solver"

#------------------------------------------------------------------------------
